```json
{
  "personal_info": {
    "name": "Shubham Kumar",
    "contact_details": {
      "phone": "+91-9711776389",
      "email": "sk311@gmail.com",
      "linkedin": "linkedin.com/in/shubham-kr-1h",
      "github": "github.com/ShubK9"
    }
  },
  "professional_summary": "Enthusiastic and motivated Software Developer with a foundational knowledge of Python, Java, and Web Development. Gained hands-on experience in building responsive, user-friendly websites using HTML, CSS, and JavaScript through personal and client projects. Passionate about continuously learning new technologies and applying problem-solving skills to create innovative solutions. Eager to contribute to impactful projects, enhance technical expertise, and grow within the IT industry while delivering high-quality applications.",
  "education": [
    {
      "institution": "Indian Institute of Computer science",
      "location": "Delhi, India",
      "degree": "Advance Diploma in Website Development",
      "duration": "June 2022 - December 2024"
    },
    {
      "institution": "Pataliputra University",
      "location": "Patna, Bihar, India",
      "degree": "B.Sc. in Mathematics (Honours)",
      "duration": "June 2021 - April 2024"
    }
  ],
  "skills": {
    "programming_languages": ["Python", "Java", "React.Js", "MySQL"],
    "web_development": ["HTML/CSS/JavaScript", "Bootstrap"],
    "libraries_and_tools": ["Pandas", "Git/GitHub"],
    "additional_skills": ["WordPress", "Adobe Photoshop", "CorelDRAW", "Adobe Illustrator", "Adobe InDesign"]
  },
  "work_experience": [
    {
      "title": "Freelancing Work",
      "location": "Delhi, India",
      "duration": "March 2024 - May 2024",
      "responsibilities": [
        "Developed a website for local travel agencies using HTML, CSS, Bootstrap, and basic JavaScript – Providing a seamless user experience and an intuitive interface for customers to explore various travel packages.",
        "Implemented responsive design principles, ensuring optimal viewing and interaction across a wide range of devices, including desktops, tablets, and smartphones.",
        "Collaborated closely with clients to understand their specific requirements and preferences, translating their vision into a functional and aesthetically pleasing website.",
        "Optimized website performance, resulting in faster loading times and improved search engine visibility, contributing to enhanced online presence and customer engagement."
      ]
    }
  ],
  "projects": [
    {
      "title": "E-commerce Website",
      "duration": "April 2024 - May 2024",
      "description": [
        "Developed a fully functional e-commerce platform using HTML, CSS, JavaScript, and React.js, enabling users to browse products, add them to a cart, and complete purchases securely.",
        "Implemented user authentication and authorization features, ensuring secure access and personalized experiences for registered users.",
        "Integrated payment gateway APIs to facilitate seamless and secure transactions, enhancing the overall user experience.",
        "Designed and implemented a responsive user interface, ensuring optimal viewing and interaction across various devices and screen sizes."
      ]
    },
    {
      "title": "Weather App",
      "duration": "March 2024 - March 2024",
      "description": [
        "Developed a dynamic weather application using HTML, CSS, and JavaScript, allowing users to search for real-time weather updates by city.",
        "Integrated a third-party weather API to fetch accurate and up-to-date weather data, including temperature, humidity, and wind speed.",
        "Implemented a user-friendly interface with clear visual representations of weather conditions, enhancing usability and accessibility.",
        "Ensured cross-browser compatibility and responsiveness, providing a consistent experience across different devices and web browsers."
      ]
    }
  ],
  "certifications": [
    "Python Programming (Online Course) - Coursera",
    "Web Development Bootcamp (Online Course) - Udemy",
    "JavaScript Essentials (Online Course) - freeCodeCamp"
  ]
}
```